In [1]:
import pandas as pd

In [2]:
asian_df = pd.read_csv('Resources/asian.csv')
black_df = pd.read_csv('Resources/black.csv')
white_df = pd.read_csv('Resources/white.csv')
latino_df = pd.read_csv('Resources/latino.csv')

In [3]:
ab_df = pd.merge(asian_df, black_df, on='DATE', how='right')
ab_df.head()

       DATE  Rate_Asian Rate_Black
0  1/1/2000         4.0        8.2
1  2/1/2000         3.4        8.1
2  3/1/2000         4.1        7.4
3  4/1/2000         3.1          7
4  5/1/2000         3.5        7.7

In [4]:
abw_df = pd.merge(ab_df, white_df, on='DATE', how='right')
abw_df.head()

       DATE  Rate_Asian Rate_Black Rate_White
0  1/1/2000         4.0        8.2        3.4
1  1/1/2000         4.0        8.2        3.4
2  2/1/2000         3.4        8.1        3.6
3  2/1/2000         3.4        8.1        3.6
4  3/1/2000         4.1        7.4        3.5

In [5]:
race_df = pd.merge(abw_df, latino_df, on='DATE', how='right')
race_df.head()

       DATE  Rate_Asian Rate_Black Rate_White  Rate_Latino
0  1/1/2000         4.0        8.2        3.4          5.6
1  1/1/2000         4.0        8.2        3.4          5.6
2  1/1/2000         4.0        8.2        3.4          5.6
3  1/1/2000         4.0        8.2        3.4          5.6
4  2/1/2000         3.4        8.1        3.6          5.7

In [6]:
men_df = pd.read_csv('Resources/men_rate.csv')
women_df = pd.read_csv('Resources/women_rate.csv')

In [7]:
gender_df = pd.merge(men_df, women_df, on='DATE', how='right')
gender_df.head()

       DATE Rate_Men Rate_Women
0  1/1/2000      3.9        4.1
1  1/1/2000      3.9        4.1
2  2/1/2000      4.1        4.1
3  2/1/2000      4.1        4.1
4  3/1/2000      3.8        4.3

In [8]:
high_df = pd.read_csv('Resources/highschool.csv')
bachelors_df = pd.read_csv('Resources/bachelors.csv')
masters_df = pd.read_csv('Resources/masters.csv')
doctoral_df = pd.read_csv('Resources/doctorals.csv')

In [9]:
hb_df = pd.merge(high_df, bachelors_df, on='DATE', how='right')
hb_df.head()

       DATE Rate _High_School Rate_Bachelors
0  1/1/2000               3.4            1.8
1  1/1/2000               3.4            1.8
2  2/1/2000               3.4            1.6
3  2/1/2000               3.4            1.6
4  3/1/2000               3.3            1.7

In [10]:
hbm_df = pd.merge(hb_df, masters_df, on='DATE', how='right')
hbm_df.head()

       DATE Rate _High_School Rate_Bachelors Rate_Masters
0  1/1/2000               3.4            1.8          1.6
1  1/1/2000               3.4            1.8          1.6
2  1/1/2000               3.4            1.8          1.6
3  1/1/2000               3.4            1.8          1.6
4  2/1/2000               3.4            1.6          1.6

In [11]:
education_df = pd.merge(hbm_df, doctoral_df, on='DATE', how='right')
education_df.head()

       DATE Rate _High_School Rate_Bachelors Rate_Masters Rate_Doctoral
0  1/1/2000               3.4            1.8          1.6           1.4
1  1/1/2000               3.4            1.8          1.6           1.4
2  1/1/2000               3.4            1.8          1.6           1.4
3  1/1/2000               3.4            1.8          1.6           1.4
4  1/1/2000               3.4            1.8          1.6           1.4

In [12]:
race_df.to_csv('Resources/race.csv')

In [13]:
gender_df.to_csv('Resources/gender.csv')

In [14]:
education_df.to_csv('Resources/education.csv')